#include <iostream>
using namespace std;

int main() {
	setlocale(0, "rus");
	int money = 0;
	char answer;

	cout << "Кто хочет стать миллионером?" << endl;
	system("pause");
	cout << "\x1B[2J\x1B[H";

	cout << "##############################################################!!!" << endl;
	cout << "На вашем счету " << money << " грн." << endl;
	cout << " " << endl;
	cout << "##############################################################!!!" << endl;
	cout << "Вопрос номер 1." << endl;
	cout << "##############################################################!!!" << endl;
	cout << "Столица Таиланда?" << endl;
	cout << "A: Бангкок; B: Ханой;" << endl;
	cout << "C: Сеул;    D: Бейрут;" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
	cout << "Ваш ответ: ";
	cin >> answer;
	if (answer == 'a' or answer == 'A') {
		money = 500;
		cout << "Ответ верный." << endl;
		cout << "##############################################################!!!" << endl;
		cout << "На вашем счету " << money << " грн." << endl;
		cout << " " << endl;
		cout << "##############################################################!!!" << endl;
		cout << "Вопрос номер 2." << endl;
		cout << "##############################################################!!!" << endl;
		cout << "Градус кипения воды?" << endl;
		cout << "A: 32°;  B: 67°;" << endl;
		cout << "C: 100°; D: 11°;" << endl;
		cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
		cout << "Ваш ответ: ";
		cin >> answer;
		if (answer == 'c' or answer == 'C') {
			money = 2000;
			cout << "Ответ верный." << endl;
			cout << "##############################################################!!!" << endl;
			cout << "На вашем счету " << money << " грн." << endl;
			cout << " " << endl;
			cout << "##############################################################!!!" << endl;
			cout << "Вопрос номер 3." << endl;
			cout << "##############################################################!!!" << endl;;
			cout << "Что не бывает морским?" << endl;
			cout << "A: Огурец;  B: Гребешок;" << endl;
			cout << "C: Капуста; D: Рельс;" << endl;
			cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
			cout << "Ваш ответ: ";
			cin >> answer;
			if (answer == 'd' or answer == 'D') {
				money = 3000;
				cout << "Ответ верный." << endl;
				cout << "##############################################################!!!" << endl;
				cout << "На вашем счету " << money << " грн." << endl;
				cout << " " << endl;
				cout << "##############################################################!!!" << endl;
				cout << "Вопрос номер 4." << endl;
				cout << "##############################################################!!!" << endl;
				cout << "В какой стране появилась мандолина?" << endl;
				cout << "A: Испания; Б: Греция;" << endl;
				cout << "C: Италия;  D: Венгрия;" << endl;
				cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
				cout << "Ваш ответ: ";
				cin >> answer;
				if (answer == 'c' or answer == 'C') {
					money = 5000;
					cout << "Ответ верный." << endl;
					cout << "##############################################################!!!" << endl;
					cout << "На вашем счету " << money << " грн." << endl;
					cout << " " << endl;
					cout << "##############################################################!!!" << endl;
					cout << "Вопрос номер 5." << endl;
					cout << "##############################################################!!!" << endl;
					cout << "Что такое лобогрейка?" << endl;
					cout << "A: жнейка;  B: шапка;" << endl;
					cout << "C: болезнь; D: печка;" << endl;
					cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
					cout << "Ваш ответ: ";
					cin >> answer;
					if (answer == 'а' or answer == 'A') {
						money = 10000;
						cout << "Ответ верный." << endl;
						cout << "##############################################################!!!" << endl;
						cout << "На вашем счету " << money << " грн." << endl;
						cout << " " << endl;
						cout << "##############################################################!!!" << endl;
						cout << "Вопрос номер 6." << endl;
						cout << "##############################################################!!!" << endl;
						cout << "Какое растение существует на самом деле?" << endl;
						cout << "А: Лох чилийский; B: Лох индийский;" << endl;
						cout << "C: Лох греческий; D: Лох русский;" << endl;
						cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
						cout << "Ваш ответ: ";
						cin >> answer;
						if (answer == 'b' or answer == 'B') {
							money = 15000;
							cout << "Ответ верный." << endl;
							cout << "##############################################################!!!" << endl;
							cout << "На вашем счету " << money << " грн." << endl;
							cout << " " << endl;
							cout << "##############################################################!!!" << endl;
							cout << "Вопрос номер 7." << endl;
							cout << "##############################################################!!!" << endl;
							cout << "Какой город объявлен официальной родиной русского Деда Мороза?" << endl;
							cout << "А: Малая Вишера;   B: Великий Устюг;" << endl;
							cout << "C: Вышний Волочек; D: Нижний Новгород;" << endl;
							cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
							cout << "Ваш ответ: ";
							cin >> answer;
							if (answer == 'b' or answer == 'B') {
								money = 25000;
								cout << "Ответ верный." << endl;
								cout << "##############################################################!!!" << endl;
								cout << "На вашем счету " << money << " грн." << endl;
								cout << " " << endl;
								cout << "##############################################################!!!" << endl;
								cout << "Вопрос номер 8." << endl;
								cout << "##############################################################!!!" << endl;
								cout << "Что проводит боксер, наносящий удар противнику снизу?" << endl;
								cout << "А: Свинг; B: Апперкот;" << endl;
								cout << "C: Хук;   D: Джэб;" << endl;
								cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
								cout << "Ваш ответ: ";
								cin >> answer;
								if (answer == 'b' or answer == 'B') {
									money = 50000;
									cout << "Ответ верный." << endl;
									cout << "##############################################################!!!" << endl;
									cout << "На вашем счету " << money << " грн." << endl;
									cout << " " << endl;
									cout << "##############################################################!!!" << endl;
									cout << "Вопрос номер 9." << endl;
									cout << "##############################################################!!!" << endl;
									cout << "Кого нет среди смешариков?" << endl;
									cout << "А: Коня; B: Барана;" << endl;
									cout << "C: Лося; D: Свиньи;" << endl;
									cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
									cout << "Ваш ответ: ";
									cin >> answer;
									if (answer == 'a' or answer == 'A')
									{
										money = 100000;
										cout << "Ответ верный." << endl;
										cout << "##############################################################!!!" << endl;
										cout << "На вашем счету " << money << " грн." << endl;
										cout << " " << endl;
										cout << "##############################################################!!!" << endl;
										cout << "Вопрос номер 10." << endl;
										cout << "##############################################################!!!" << endl;
										cout << "Как называется ближайшая к Земле звезда?" << endl;
										cout << "А: Полярная; B: Проксиома Центавра;" << endl;
										cout << "C: Солнце;   D: Меркурий;" << endl;
										cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
										cout << "Ваш ответ: ";
										cin >> answer;
										if (answer == 'c' or answer == 'C') {
											money += 200000;
											cout << "Ответ верный." << endl;
											cout << "##############################################################!!!" << endl;
											cout << "На вашем счету " << money << " грн." << endl;
											cout << " " << endl;
											cout << "##############################################################!!!" << endl;
											cout << "Вопрос номер 11." << endl;
											cout << "##############################################################!!!" << endl;
											cout << "Что вращается вокруг Земли?" << endl;
											cout << "A: Луна; B: Солнце;" << endl;
											cout << "C: Марс; D: Венера;" << endl;
											cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
											cout << "Ваш ответ: ";
											cin >> answer;
											if (answer == 'a' or answer == 'A') {
												money = 400000;
												cout << "Ответ верный." << endl;
												cout << "##############################################################!!!" << endl;
												cout << "На вашем счету " << money << " грн." << endl;
												cout << " " << endl;
												cout << "##############################################################!!!" << endl;
												cout << "Вопрос номер 12." << endl;
												cout << "##############################################################!!!" << endl;
												cout << "Как назывались старинные русские пушки-гаубицы?" << endl;
												cout << "А: Василиск; B: Грифон;" << endl;
												cout << "C: Кентавр;  D: Единорог;" << endl;
												cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
												cout << "Ваш ответ: ";
												cin >> answer;
												if (answer == 'd' or answer == 'D') {
													money = 800000;
													cout << "Ответ верный." << endl;
													cout << "##############################################################!!!" << endl;
													cout << "На вашем счету " << money << " грн." << endl;
													cout << " " << endl;
													cout << "##############################################################!!!" << endl;
													cout << "Вопрос номер 13." << endl;
													cout << "##############################################################!!!" << endl;
													cout << "Как называется место на берегу, где обитают тюлени?" << endl;
													cout << "А: Пастбище; B: Лежбище;" << endl;
													cout << "C: Стойбище; D: Гульбище;" << endl;
													cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
													cout << "Ваш ответ: ";
													cin >> answer;
													if (answer == 'b' or answer == 'B') {
														money = 1500000;
														cout << "Ответ верный." << endl;
														cout << "##############################################################!!!" << endl;
														cout << "На вашем счету " << money << " грн." << endl;
														cout << " " << endl;
														cout << "##############################################################!!!" << endl;
														cout << "Последний вопрос." << endl;
														cout << "##############################################################!!!" << endl;
														cout << "Что гоняют по игровому полю футболисты?" << endl;
														cout << "A: Мяч;  B: Шайбу;" << endl;
														cout << "C: Ядро; D: Судью;" << endl;
														cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++!!!" << endl;
														cout << "Ваш ответ: ";
														cin >> answer;
														if (answer == 'a' or answer == 'A') {
															money = 3000000;
															cout << "Это победа! Вы вигирали: " << money << "грн." << endl;
														}
														else {
															cout << "Вы проиграли";
														}
													}
													else {
														cout << "Вы проиграли";
													}
												}
												else {
													cout << "Вы проиграли";
												}
											}
											else {
												cout << "Вы проиграли";
											}
										}
										else {
											cout << "Вы проиграли";
										}
									}
									else {
										cout << "Вы проиграли";
									}
								}
								else {
									cout << "Вы проиграли";
								}
							}
							else {
								cout << "Вы проиграли";
							}
						}
						else {
							cout << "Вы проиграли";
						}
					}
					else {
						cout << "Вы проиграли";
					}
				}
				else {
					cout << "Вы проиграли";
				}
			}
			else {
				cout << "Вы проиграли";
			}
		}
		else {
			cout << "Вы проиграли";
		}
	}
	else {
		cout << "Вы проиграли";
	}
}
